tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "dreamhost/homebrew", "git@git.dreamhost.com:dreamhost/homebrew-repo.git"

brew "curl"

# Libs and priorities
brew "libpng"
brew "ca-certificates"
brew "freetype"
brew "gettext"
brew "gd"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "icu4c"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libjpeg"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "ncurses"
brew "openssl"
brew "re2c"
brew "readline"
brew "tcl-tk"
brew "utf8proc", args: ["HEAD"]
brew "universal-ctags"
brew "util-linux"
brew "xz"
brew "zlib"

# GNU replacements/additions
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "binutils"
brew "autoconf"
brew "bash"
brew "bison"
brew "ed"
brew "emacs"
brew "file-formula"
brew "flex"
brew "gawk"
brew "gpatch"
brew "grep"
brew "gzip"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "libressl"
brew "less"
brew "m4"
brew "make"
brew "nano"
brew "openssh"
brew "rsync"
brew "screen"
brew "unzip"
brew "watch"
brew "wdiff"
brew "wget"

# Build tools/libs
brew "automake"
brew "autogen"
brew "cmake"
brew "gcc"
brew "glib"
brew "glibc" if OS.linux?
brew "libtool"
brew "llvm"
brew "lld"
brew "pkgconf"

# Other
brew "perltidy"
brew "repomix"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tree"
brew "xdg-ninja"
brew "zsh"

# Mac
if OS.mac?
  brew "mas"
  brew "arduino-cli"
  brew "fontconfig"

  brew "dreamhost/homebrew/lde", args: ["HEAD"]

  cask "font-fira-code"
  cask "font-hack"
  cask "font-new-york"
  cask "font-sf-mono"
  cask "font-sf-pro"
  cask "font-symbols-only-nerd-font"

  cask "dropbox"
  cask "flycut"
  cask "homerow"
  cask "firefox@developer-edition"
  cask "openvpn-connect"
  cask "orbstack"
  cask "postman"
  cask "rectangle"
  cask "slack"
  cask "spotify"
  cask "wezterm"

  mas "Dashlane", id: 517914548
end
