tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "dreamhost/homebrew", "git@git.dreamhost.com:dreamhost/homebrew-repo.git"

brew "libpng"
brew "autoconf"
brew "pkgconf"
brew "autogen"
brew "automake"
brew "bison"
brew "fontconfig"
brew "openssl@3"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gd"
brew "icu4c@76"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "imagemagick"
brew "jpeg"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libsodium"
brew "libxml2"
brew "libzip"
brew "make"
brew "mas" if OS.mac?
brew "neofetch"
brew "openldap"
brew "perltidy"
brew "re2c"
brew "showkey"
###########brew "stow"
brew "tree"
brew "universal-ctags"
brew "utf8proc", args: ["HEAD"]
brew "wget"
brew "xdg-ninja"
brew "zlib"
brew "zsh"

brew "dreamhost/homebrew/lde", args: ["HEAD"] if OS.mac?

cask "font-dejavu-sans-mono-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-droid-sans-mono-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-fira-code-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-hack-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-jetbrains-mono-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-meslo-lg-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-monaspace-nerd-font", args: { fontdir: "~/.local/share/fonts" }
cask "font-new-york" if OS.mac?
cask "font-sf-mono" if OS.mac?
cask "font-sf-pro" if OS.mac?

cask "dropbox" if OS.mac?
cask "flycut" if OS.mac?
cask "homerow" if OS.mac?
#cask "iterm2" if OS.mac?
cask "openvpn-connect" if OS.mac?
cask "orbstack" if OS.mac?
cask "postman" if OS.mac?
cask "rectangle" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
#cask "visual-studio-code" if OS.mac?
cask "wezterm" if OS.mac?

mas "Dashlane", id: 517914548 if OS.mac?
