tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "dreamhost/homebrew", "git@git.dreamhost.com:dreamhost/homebrew-repo.git"

brew "curl"
brew "wget"

brew "autoconf"
brew "automake"
brew "autogen"
brew "bison"
brew "cmake"
brew "gcc"
brew "glib"
brew "glibc" if OS.linux?
brew "libtool"
brew "llvm"
brew "lld"
brew "m4"
brew "make"
brew "pkgconf"

brew "ca-certificates"
brew "gettext"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "imagemagick"
brew "libsodium"
brew "libyaml"
brew "ncurses"
brew "openssl"
brew "readline"
brew "tcl-tk"
brew "utf8proc", args: ["HEAD"]
brew "universal-ctags"
brew "xz"
brew "zlib"

brew "coreutils"
brew "findutils"
brew "diffutils"
brew "binutils"

brew "gawk"
brew "grep"
brew "gzip"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"

brew "ed"
brew "less"
brew "rsync"
brew "unzip"

brew "perltidy"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tree"
brew "xdg-ninja"
brew "zsh"

if OS.mac?
  brew "mas"
  brew "arduino-cli"
  brew "fontconfig"

  brew "dreamhost/homebrew/lde", args: ["HEAD"]

  cask "font-hack-nerd-font"
  cask "font-fira-code-nerd-font"
  cask "font-new-york"
  cask "font-sf-mono"
  cask "font-sf-pro"

  cask "dropbox"
  cask "flycut"
  cask "homerow"
  cask "iterm2"
  cask "google-chrome"
  cask "openvpn-connect"
  cask "orbstack"
  cask "postman"
  cask "rectangle"
  cask "slack"
  cask "spotify"
  cask "visual-studio-code"
  cask "wezterm"

  mas "Dashlane", id: 517914548
end
