autoconf
brotli
c-ares
ca-certificates
cmake
coreutils
curl
diffutils
docker
docker-completion
docker-compose
docker-credential-helper
fd
findutils
fontconfig
freetype
gawk
gcc
gettext
git
glow
gmp
gnu-sed
grep
icu4c@75
icu4c@76
isl
jansson
jq
lde
libgit2
libidn2
liblinear
libmpc
libnghttp2
libpng
libsodium
libssh2
libunistring
libuv
libvterm
libyaml
llvm
lpeg
lua
luajit
luv
lz4
m4
mpdecimal
mpfr
msgpack
ncurses
neofetch
neovim
nmap
node
oniguruma
openssl@3
pcre
pcre2
perltidy
pkg-config
python@3.12
python@3.13
readline
repomix
repopack
ripgrep
rtmpdump
ruby
rust
screenresolution
shellcheck
shfmt
showkey
sqlite
starship
stow
telnet
tree
tree-sitter
unibilium
universal-ctags
utf8proc
vim
wget
xdg-ninja
xz
yaml-language-server
yarn
z3
zsh
zstd
appcleaner
dropbox
flycut
font-dejavu-sans-mono-nerd-font
font-droid-sans-mono-nerd-font
font-fira-code-nerd-font
font-hack-nerd-font
font-jetbrains-mono-nerd-font
font-meslo-lg-nerd-font
font-monaspace-nerd-font
homerow
iterm2
openvpn-connect
orbstack
postman
rectangle
slack
spotify
visual-studio-code
wezterm
